app/views/rents/_form.html.erb

    <label>Aluno</label>
    <%= f.collection_select(:student_id, Student.where(blocked: false, active: true), :id, :rented, {prompt: "Selecione um aluno"}) %>
---
SELECT "students".* FROM "students" WHERE "students"."blocked" = $1 AND "students"."active" = $2  [["blocked", false], ["active", true]]

    <label>Livro</label>
    <%= f.collection_select(:book_id, Book.where(available: true), :id, :name, {prompt: "Selecione um livro"}) %>
---
SELECT "books".* FROM "books" WHERE "books"."available" = ?  [["available", true]]