app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (name LIKE '%0%')
SELECT "books".* FROM "books"
---
  def index
    @books = Book.where(nil)
    @books = @books.byname(params[:byname]) if params[:byname].present?

INSERT INTO "books" ("name", "author", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "teste"], ["author", "teste"], ["description", "teste"], ["created_at", 2017-02-05 12:36:00 UTC], ["updated_at", 2017-02-05 12:36:00 UTC]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "description" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["description", "Uma maravilha aventure, do começo ao fim."], ["updated_at", 2017-02-03 13:22:14 UTC], ["id", 4]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)