app/controllers/pages_controller.rb

SELECT "rents".* FROM "rents" WHERE (returned = 'f' and bring_back <= '2017-01-26') ORDER BY "rents"."bring_back" ASC
---
  def notreturned
    @rents = Rent.where("returned = ? and bring_back <= ?", false, Date.today).order(:bring_back)