app/controllers/rents_controller.rb

  def index
    @rents = Rent.where(returned: false)
---
SELECT "rents".* FROM "rents" WHERE "rents"."returned" = ?  [["returned", false]]

  def create
    @rent = Rent.new(rent_params)
    @book = Book.find(@rent.book_id)
    @book.available = false
    @book.save
    respond_to do |format|
      if @rent.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "available" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["available", false], ["updated_at", 2017-01-26 21:01:13 UTC], ["id", 1]]
INSERT INTO "rents" ("student_id", "book_id", "returned", "bring_back", "obs", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["student_id", 2], ["book_id", 2], ["returned", true], ["bring_back", Tue, 24 Jan 2017], ["obs", ""], ["created_at", 2017-01-26 21:45:30 UTC], ["updated_at", 2017-01-26 21:45:30 UTC]]

  def update
    respond_to do |format|
      if @rent.update(rent_params)
        @book = Book.find(@rent.book_id)
        @book.available = true
        @book.save
---
UPDATE "rents" SET "book_id" = ?, "returned" = ?, "bring_back" = ?, "updated_at" = ? WHERE "rents"."id" = ?  [["book_id", 4], ["returned", false], ["bring_back", Wed, 04 Jan 2017], ["updated_at", 2017-01-27 15:10:53 UTC], ["id", 4]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "available" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["available", true], ["updated_at", 2017-01-27 18:46:04 UTC], ["id", 4]]

  def destroy
    @rent.destroy
---
DELETE FROM "rents" WHERE "rents"."id" = ?  [["id", 1]]

  def bring
    @rent.returned = true
    @rent.save
---
UPDATE "rents" SET "returned" = ?, "updated_at" = ? WHERE "rents"."id" = ?  [["returned", true], ["updated_at", 2017-01-27 14:58:23 UTC], ["id", 4]]

    def set_rent
      @rent = Rent.find(params[:id])
---
SELECT  "rents".* FROM "rents" WHERE "rents"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]