app/controllers/students_controller.rb

  def index
    @students = Student.where(nil)
    @students = @students.byname(params[:byname]) if params[:byname].present?
---
SELECT "students".* FROM "students" WHERE (name LIKE %'a'%)
SELECT "students".* FROM "students" ORDER BY "students"."name" ASC

  def show
    @books = Book.where(id: Rent.where(student_id: @student.id).pluck(:book_id))
---
SELECT "rents"."book_id" FROM "rents" WHERE "rents"."student_id" = ?  [["student_id", 1]]

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "phone" = ?, "blocked" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["phone", ""], ["blocked", true], ["updated_at", 2017-01-27 15:32:51 UTC], ["id", 1]]